
import React from "react";
import ContainerLayout from "globals/components/ContainerLayout";
import ContainerHeader from "globals/components/ContainerHeader";
import "./contact.style.scss";
class Home extends React.Component {
  render() {
    return (
      <ContainerLayout>
        <ContainerHeader  style={{display:'flex',justifyContent:"center",fontwight:'bold'}}   title="સેન્ટ્રલ કમીટી" />
        <div className="home">
          <div>
        <h3>શ્રી શુકલભાઈ મોહનભાઈ દલવાડી(અઘ્યક્ષશ્રી): 9427893375</h3>
        <h3>શ્રી જયેન્દ્રભાઈ છીતુભાઈ દલવાડી (પ્રમુખશ્રી): 9879550665</h3>  
        <h3>શ્રી અશોકભાઈ મોતીભાઈ મારૂ (ઉપપ્રમુખશ્રી): 9725420217</h3>
          <h3>શ્રી કનુભાઈ ભીખાભાઈ પ્રજાપતિ(મંત્રીશ્રી): 9825463144</h3>
          <h3>શ્રી જયંતિભાઈ નરોત્તમભાઈ પ્રજાપતિ (સહમંત્રીશ્રી) : 9925014231</h3>
          <h3>શ્રી મુળજીભાઈ રામજીભાઈ મારૂ(ખજાનચીશ્રી  ): 9157250560</h3>
          <h3>શ્રી કનુભાઈ રણછોડભાઈ મારૂ (કારોબારી સભ્ય) : 9377437788</h3>                                       
</div>
<ContainerHeader   title="આમદવાદ ઝોન કમીટી" />
<div>
         <h3>શ્રી રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>શ્રી અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>શ્રી પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
    </div>
    <ContainerHeader   title="વડોદરા ઝોન કમીટી" />
      <div>
          <h3>શ્રી દેવેન્દ્રભાઈ અરવિંદભાઈ પ્રજાપતિ(પ્રમુખ): 9824340015</h3>
          <h3>શ્રી અંબાલાલભાઈ છીતાભાઈ મારૂ (ઉપપ્રમુખશ્રી): 9898075142</h3>
          <h3>શ્રી દુર્ગેશભાઈ ગોરધનભાઈ પ્રજાપતિ (મંત્રીશ્રી):9173418046</h3>
          <h3>શ્રી આશિષભાઈ રમેશભાઈ પ્રજાપતિ(સહમંત્રીશ્રી):958687370</h3>
          <h3>શ્રી અશોકભાઈ સોમાભાઈ પ્રજાપતિ(ખજાનજી): 9898819327</h3>
          <h3>શ્રી રણછોડભાઈ તળજાભાઈ મારૂ(સંગઠન મંત્રી):9638771365</h3>
</div>
<ContainerHeader   title="ભરૂચ ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
<ContainerHeader   title="કરજણ ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div> <ContainerHeader   title="પાદરા ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
          <div>
            <h2>વેબસાઇટ મોબાઇલ એપ્લિકેશન સંપર્ક: </h2>
            <h3>
              {" "}
              વેબસાઇટ અથવા મોબાઇલ એપ્લિકેશનમાં કોઈ તકનીકી ભૂલ હોવાના કિસ્સામાં,
              નીચેની વિગતો પર કેતન પ્રજાપતિનો સંપર્ક કરો.
            </h3>
          </div>
          <h2>
            કેતનભાઈ ઘનશ્યામભાઈ પ્રજાપતિ : 9924731218,ketanprajapati245@gmail.com
          </h2>
        </div>
      </ContainerLayout>
      
    );
  }
}

export default Home;
