
import React from "react";
import ContainerLayout from "globals/components/ContainerLayout";
import ContainerHeader from "globals/components/ContainerHeader";
import "./contact.style.scss";
class Home extends React.Component {
  render() {
    return (
      <ContainerLayout>
        <ContainerHeader  style={{display:'flex',justifyContent:"center",fontwight:'bold'}}   title="સેન્ટ્રલ કમીટી" />
        <div className="home">
          <div>
        <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
<ContainerHeader   title="આમદવાદ ઝોન કમીટી" />
<div>
         <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
    </div>
    <ContainerHeader   title="વડોદરા ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
<ContainerHeader   title="ભરૂચ ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
<ContainerHeader   title="કરજણ ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div> <ContainerHeader   title="પાદરા ઝોન કમીટી" />
      <div>
          <h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ): 9924917390</h3>
          <h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી): 90990 25985</h3>
          <h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી): 9898007037</h3>
</div>
          <div>
            <h2>વેબસાઇટ મોબાઇલ એપ્લિકેશન સંપર્ક: </h2>
            <h3>
              {" "}
              વેબસાઇટ અથવા મોબાઇલ એપ્લિકેશનમાં કોઈ તકનીકી ભૂલ હોવાના કિસ્સામાં,
              નીચેની વિગતો પર કેતન પ્રજાપતિનો સંપર્ક કરો.
            </h3>
          </div>
          <h2>
            કેતનભાઈ ઘનશ્યામભાઈ પ્રજાપતિ : 9924731218,ketanprajapati245@gmail.com
          </h2>
        </div>
      </ContainerLayout>
      
    );
  }
}

export default Home;
