import React, { Component } from "react";
import ContainerLayout from "globals/components/ContainerLayout";
export default class History extends Component {
  render() {
    return (
      <ContainerLayout>
        <div className="home">
          <div className="home-contain">
            <p>
               વિક્રમ સવંત ૧૬૩૨ માઁ મારવાડ પ્રદેશ્માંથી મારુ સમાજના કુટુમ્બો અનિવાર્ય સંજોગોને કારણે ગુજરાતમાઁ અમદાવાદ શહેર મા આવી ને વસેલા.ત્યાર બાદ ત્યાંથી વડોદરા અને ભરુચ જિલ્લામાઁ જે પ્રદેશ વાક્ળ અને કાનમ તરીકે ઓળખાય છે.ત્યાઁ થી આવી વસેલા.મારવાડ છોડી આવનાર ભીથરોટીયા,થરાદથી આવનાર થરદરા 
અને વિસાથી આવનાર વિસા તરીકે ઓળખાયા.સમય જતાઁ સંજોગોવસાત્ વિસા તડ અલગ થયેલુ.જ્યારે ત્રણ તડ હાલમાઁ પણ સંગથિત છે.પ્રજાપતિ સમાજની મુખ્ય ૮૪ જાતિ છે.તેમાઁ મારુ જ્ઞાતિ તરીકે સમાવેશ થયેલો છે.આપને મારુ,મોસા,કુમાર,કુમાવત અને કુમ્હાર પ્રજાપતિ તરીકે ઓળખાઈએ છીએ.
ઈ.સ.૧૯૪૭ માઁ પંચની રચના કરવામાઁ આવેલી જેનો વહીવટ શ્રી રાવજીભાઈ હરીભાઈ મારુ કરતા હતા.ત્યારબાદ  સવંત ૨૦૩૯ પોષ વદ ૧૩ ને રવિવાર ઈ.સ. ૧૯૮૧માઁ ટીમ્બરવા મુકામે સ્વ.વિઠ્ઠલભાઇ પ્રજાપતિએ જીવન ક્રિયા પ્રસંગે સમસ્ત ત્રણેય તડને બોલાવેલા તે જ દિવસે સમગ્ર જ્ઞાતિજનોની હાજરીમા શ્રી મારુ પ્રજાપતિ
પ્રગતિ મંડળ,વડોદરા ની રચના કરવામાઁ આવેલી.તેમાઁ પ્રમુખ તરીકે શ્રી શુકલભાઈ મોહનભાઈ દલવાડી તથા મંત્રી તરીકે શ્રી ઇશ્વરભાઇ અઁબાલાલ પ્રજાપતિ ની નિમણૂક કરવામાઁ આવેલી.તેમાઁ કૌટુઁબિક માહિતી એક્ત્રિત કરવા ફોર્મનુ વિતરણ કરવામાઁ આવેલુઁ.
ઈ.સ.૧૯૮૩માઁ નોટબૂક,પુસ્તકો અને ધો.૧૦/૧૨ માઁ પાસ થનારને રોકડ ઈનામનુઁ આયોજન કરેલ.</p>

<p>ઈ.સ.૧૮૮૪ માઁ મંડળ ના નેજા હેઠળ દ્વિતિય સઁમેલન દુધવાડા મુકામે રાખવામાઁ આવેલુઁ હતુ.ત્યારબાદ ત્યાઁ તા.૧૭/૫/૮૭ ના રોજ સમની મુકામે શ્રી શંકરભાઈ માધવભાઈ મારુ ને ત્યાઁ તુતિયા સઁમેલનનુ અયોજન કરવામા આવેલુ.ત્યારબાદ ૧૯૯૩ મા મકરપુરા મુકામે મંડળની પુન:રચના કરવામાઁ આવેલી અને તેમાઁ પ્રમુખ તરીકે કે
 શ્રી ઇશ્વરભાઇ અઁબાલાલ પ્રજાપતિ તથા મંત્રી તરીકે શ્રી કનુભાઇ રણછોડભાઇ મારુ ની નિમણુક કરવામાઁ આવેલી.ત્યાર પછી સમાજના આર્થિક તથા સમાજિક લાભાર્થે સમાજના તમામ ભાઈઓને સાથે રાખી 'સમુહ લગ્ન' નુ આયોજન કરવામાઁ આવ્યુઁ.મંડળ ના નેજા હેઠળ સમાજનુઁ પ્રથમ 'સમુહ લગ્ન' સવંત ૨૦૫૦ના મહાવદી
૯ને રવિવાર તા.૬/૩/૧૯૯૪ ના રોજ મુ.મુવાલ,તા.પાદરા ખાતે રાખવામાઁ આવ્યુ હતુઁ.જેમા ૪ જોડાઁ હતા.તથા સુંદર અને સરળ આયોજન કરવામાઁ આવ્યુ હતુ.સમાજનુઁ બીજુ 'સમુહ લગ્ન' સવંત ૨૦૫૦ના વૈશાખ સુદ ૧૦ને શુક્ર્વાર તા.૨૦/૫/૧૯૯૪ના રોજ મુ.મુવાલ ,તા.પાદરા ખાતે રાખવામાઁ આવ્યુ હતુઁ.જેમાઁ ૫ જોડાએ પ્રભુતામાઁ પગલાઁ 
માંડયા હતા.</p>
<p>ત્યારબાદ સમાજનુ ત્રીજુ 'સમુહ લગ્ન' સવંત ૨૦૫૨ના વૈશાખ વદ ૧૧ ને સોમવાર તા.૧૩/૫/૧૯૯૬ના રોજ મુ.મુવાલ ,તા.પાદરા ખાતે રાખવામાઁ આવ્યુ હતુ.૧૯૯૬ મા પરિચય પુસ્તિકા બનાવવા માટે કૌટુઁબિક માહિતી પત્રકો તૈયાર કરવામાઁ આવ્યા હતા.જે પુરતાઁ ન હતા.જેથી પુસ્તિકાનુઁ અયોજન કરી શકયા નહિઁ.
ત્યારબાદ વારઁવાર જાણ કરવા છતા 'સમુહ લગ્ન' ની કર્યાવાહી મંદ પડી ગઈ હતી.છતાઁ પણ વડોદરા ના સક્રિય કાર્યકર્તાઓએ નિરાશ થયા વગર મંડળ ની કાર્યવાહી ચાલુ રાખી હતી.તેવામાઁ ભરુચ મુકામે અખિલ ગુજરાત પ્રજાપતિ સંઘનુ વિશાળ સઁમેલન યોજાયુ.જેમા મારુ પ્રજાપતિ સમાજ ના ઘણા ભાઈઓ વિશાળ સંખ્યામાઁ 
હાજર રહ્યા હતા.જેમાઁ ભરુચ ના ભાઈઓએ મંડળ ને વધુ સક્રિય બનાવાની તૈયારી બતાવી હોવાથી સમર્ગ જ્ઞાતિજનોની મિટિઁગ તા.૨/૫/૨૦૦૪ ના રોજ ભરુચ મુકામે રાખવામાઁ અવિ હતી.જેમાઁ 'સમસ્ત મારુ પ્રજાપતિ પ્રગતિ મંડળની પુન:રચના કરવામાઁ આવી તેમજ તેનુ બંધારણ તૈયાર કરવામા આવ્યુ.જેમાઁ પ્રમુખ તરીકે શ્રી 
ઈશ્વરભાઈ અબાઁલાલ પ્રજાપતિ,મંત્રી તરીકે શ્રી કનુભાઈ રણછોડભાઈ મારુની નિમણુક કરવામાઁ આવી તથા વિસ્તાર પ્રમાણે કુલ ૨૧ કારોબારી સભ્યોની નિમણુક કરી વ્યવસ્થાપક સમિતિનિ રચના કરવામાઁ આવી.</p>

<p>આપણા સમાજ ના પાંચ જોન બનાવવામાઁ આવ્યા.જોન ન.૧ વડોદરા,જોન નઁ.૨ અમદાવાદ,જોન નઁ.૩ ભરુચ,જોન નઁ.૪ કરજણ,જોન નઁ.૫ પાદરા રાખવામાઁ આવ્યાઁ.દરેક જોનમાઁ જોનલ પ્રમુખ ,જોનલ મંત્રી,જોનલ ખજાનચી,સંગથન મંત્રી તથા જોનલ કારોબારી સભ્યોની નિમ્ણૂક કરવામા આવી.તમામ જોનમાંથી તમામ કુટુમ્બો
પાસેથી વાર્ષિક ફી રુ।.૧૦૧/- ઉઘરાવવી તેવુઁ નકકી કરવામા આવ્યુઁ.શ્રી સમસ્ત મારુ પ્રજાપતિ મંડળ ની ઓફિસ વડોદરા મુકામે પ્રમુખ શ્રી ઇશ્વરભાઈ પ્રજાપતિ ને ત્યાઁ રાખવી તેવુઁ નકકી કરવામાઁ આવ્યુઁ.મંડળ નુ રજીસ્ટ્રેશન,વડોદરા મુકામે કરવામાઁ આવેલ છે.જેનો રજી.નઁબર એ/૩૦૩૦/વડોદરા તા.૩૧/૧/૨૦૦૫ છે.
ત્યારબાદ તમામ જ્ઞાતિજનોની  માહિતિના ફોર્મ બનાવી તમામ જોનમાઁ આપી કૌટુઁબિ એક્ત્ર કરી "સમાજ દર્શન" પુસ્તિકા તૈયાર્ર કરવા માટે નકકી થયુઁ.'સમાજ દર્શન' પુસ્તિકાતૈયાર થયા બાદ તેનુઁ વિમોચન યોગ્ય સ્થળે રાખવાનુ નકકી કરવામાઁ આવ્યુઁ.</p>
<p>આ રીતે મંડળ ગતિમય થતાઁ મંડળના તમામ હોદ્દેદારો તથા કારોબારી સભ્યો સક્રિય થતાઁ જ્ઞાતિજનોનો અભુતપુર્વ સહકાર મળતાઁ આજે મંડળ સારી રીતે પ્રગતિ કરી રહ્યુ છે.અને ભવિષ્યમાઁ પણ કરશે જ.તેના માટે સમાજની દરેક વ્યક્તિ તન,મન,ધનથી સહકાર આપશે એવી આશા અસ્થાને નથી જ.</p>

<p>ભૂતપુર્વ અધ્યક્ક્ષ સ્વ. શ્રી ઇશ્વરભાઈ અઁબાલાલ પ્રજાપતિના સૌજન્યથી.
            </p>
          </div>
        </div>
      </ContainerLayout>
    );
  }
}
