import React from "react";
import ContainerLayout from "globals/components/ContainerLayout";
import { Carousel } from "antd";
import PIC1 from "../../assets/images/IMG-20191120-WA0138.jpg";
import PIC2 from "../../assets/images/IMG-20191120-WA0190.jpg";
import PIC3 from "../../assets/images/IMG-20191120-WA0184.jpg";
import PIC4 from "../../assets/images/IMG-20191120-WA0157.jpg";
import{Row,Col} from "antd";
import "./home.style.scss";
class Home extends React.Component {

  constructor() {
    debugger;
    super();
    this.state = {
      memberList: [
    //     {"id":1,"s_name":"રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)","zone_id":1},
    //     {"id":2,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":2},
    //     {"id":3,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":3},
    //     {"id":4,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":4},
    //     {"id":5,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":5},
    //     {"id":6,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":1},
    //     {"id":7,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":1},
    //     {"id":8,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":1},
    //     {"id":9,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":1},
    //     {"id":10,"s_name":"અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)","zone_id":2},
    //  
   ],
    }
  }

  componentDidMount = () => {
    this.callAllMembersAPi()
  }

  callAllMembersAPi = (values={}) => {
    //debugger;
      return fetch('http://localhost:4444/members/all', {
      method: 'POST',
      headers: {
        Accept: 'application/json',
        'Content-Type': 'application/json',
      },
      body: JSON.stringify(values),
    }).then((response) => response.json())
      .then((responseJson) => {
        debugger;
        console.log("members data response", responseJson)
        this.setState({ memberList: responseJson })
        return responseJson;
      }).catch((error) => {
        console.error(error);
      });
  }

  render() {
    return (
      <ContainerLayout>
        <div className="home">
          <h2 style={{display:'flex',justifyContent:"center"}}>
            સમસ્ત મારુ પ્રજાપતિ પ્રગતિ મંડળ આપનું હાર્દિક સ્વાગત કરે છે
          </h2>
          <Carousel autoplay>
            <div>
              <img style={{ objectFit: "contain" }} alt="img-1" src={PIC1} />
            </div>
            <div>
              <img style={{ objectFit: "contain" }} alt="img-1" src={PIC2} />
            </div>
            <div>
              <img style={{ objectFit: "contain" }} alt="img-1" src={PIC3} />
            </div>
            <div>
              <img style={{ objectFit: "contain" }} alt="img-1" src={PIC4} />
            </div>
          </Carousel>
          <div className="home-contain">
            કુંભારીકામના ઘાટ-ઘડતરના છત્રીસ કાંઠા ગણાય છે
  
            <p>જૂના જમાનામાં દેશી રજવાડાંઓના વખતમાં નવું ગામ વસાવે અને ગામનું તોરણ બંધાય ત્યારે ત્યાં વસવાટ કરનારાઓની જરૂરિયાતો પૂરી પાડે તેવી સઈ (દરજી), સુથાર, વાળંદ, ઢોલી, શરણાયા અને કુંભાર જેવા કારીગર વર્ગોને ખાસ તેડાવીને ગામમાં વસાવવામાં આવતા. એને કારણે તેઓ વસવાયા તરીકે ઓળખાયા હશે એમ કહેવાય છે, પણ આજે તો મારે વાત કરવી છે જેના વગર લગ્ન જેવો મંગલ પ્રસંગ ન ઉકેલાય એવા કુંભાર- કારીગરોની. લોકોક્તિ કથે છે કે ‘નગારાં અને રણશીંગા વગરનું સૈન્ય હોય તો વાળંદ અને કુંભાર વગર્યનું ગામ હોય.’ કહેવત બંનેની અનિવાર્યતા જણાવે છે.
  ગુજરાત, સૌરાષ્ટ્ર અને કચ્છના ગામડાંઓમાં તમે જાઓ તો ત્યાં કુંભારવાડામાં કુંભાર કુટુંબોના એકાદ બે ખોરડાં અવશ્ય જોવા મળવાનાં જ. આ કુંભારો વાટલિયા, વરિયા, કડિયા, હાંડલિયા, સોરઠિયા, ગુર્જર અને મજોકઠિયા જેવી અટકો ધરાવે છે. આ ઉપરાંત ઓઝા, પાટડિયા, સતાપુરા, ચાવડા, પરમાર, ચૌહાણ, વિરગામીયા જેવી અટકો પણ મળે છે.
  મોહેંજોદડોની પાંચ હજાર વર્ષ પુરાણી વાસણો બનાવવાની જે પરંપરા હતી તેમાં આજે ય બહુ ફેરફારો થયા નથી. જે ફેરફારો થયા છે તે માટીના વાસણોને પકવવાની પઘ્ધતિમાં અને હાથચાકડાને બદલે ઈલેક્ટ્રિક ચાકડા વાપરતા થયા તે છે. જૂના કાળે ગામડાના અભણ કુંભારો ચાકડા ઉપર બાવન જાતના ઠામ-વાસણો બનાવતાં. એમાંના ઘણાં જરૂરિયાતને અભાવે ભૂલાઇ ગયાં. એ પછી કુંભારીકામના ઘાટ-ઘડતરના છત્રીસ કાંઠા આવડે એને બાજંદો અર્થાત્ પૂરો કારીગર ગણવામાં આવતો. </p>
  
  <p>શ્રી વિનોદ આચાર્યએ આવા છત્રીસ કાંઠા આ મુજબ નોંઘ્યા છે.
   ૧. કોડિયું ૨. રામૈયું (રામપાતર) ૩. પડઘલો
   ૪. ચકલો ૫. ઢાંકણી ૬. લોટી ૭. આવળિયું
   ૮. ગુજરડો ૯. ગડુડુ ૧૦. ઘડુલોટી ૧૧. મોરિયો ૧૨. માટલી ૧૩.માટલું ૧૪. ગોળો ૧૫. માણ
  ૧૬. માણિયો ૧૭. બતક ૧૮. ઘૂણિયો
  ૧૯. જાકરો ૨૦. દળણાની કુંડી ૨૧. કુંડું-કૂંડી ૨૨. ઘીની વાઢી ૨૩. કુલડી-ભંભો
  ૨૪. છાશ કરવાની મોટી ગોળી ૨૫. કડહલી
  ૨૬. તાવડી ૨૭. કથરોટ ૨૮. તાવો
  ૨૯. કદો (પાટિયો- કડાઇ નાકાવાળી) ૩૦. ગરબો ૩૧. ઘોઘા ૩૨. સાંતકિયા ૩૩. મોભિયાં
  ૩૪. છાશનું દોણું ૩૫. નળિયાં
  ૩૬. ગાગરબેડિયું. (કુંભાર ઘાટ ઘડે ત્યારે ગઢેચી માતાને ચડાવે છે.
   ગામ બંધાયું હોય ત્યારથી આ રિવાજ ચાલ્યો આવે છે. </p>
   <p>ગ્રામપ્રજાને માટીના વાસણો, નળિયાં, ઇંટો, દિવાળીના મેરાયાં અને દેવના દીધેલાં બાળકોને રમકડાં પુરાં પાડતાં કુંભારો પોતાને દક્ષ પ્રજાપતિના વંશજો ગણે છે, તેઓ કહે છે કે, પ્રજાપતિ બ્રહ્મા જે રીતે પંચતત્ત્વ વડે માનવી બનાવે છે તે રીતે અમે માટી, પાણી, પ્રકાશ, હવા અને અગ્નિ વડે માટીના કુંભનું સર્જન કરીએ છીએ. આ કુંભ બનાવનાર તે કુંભકાર. લોકોને બોલવામાં સરળ પડે એટલે અપભ્રંશ કુંભાર કરી દીઘું. જૂના કાળે અમારાં ઘર વટેમાર્ગુઓને માટે ઉતારાનું ઠેકાણું ગણાતાં. મહાભારતના સમયમાં પાંડવો દ્રૌપદીના સ્વયંવરમાં ગયા ત્યારે અમારે ત્યાં ‘કુંભારવાસો’ કર્યો હતો.
  લોકસંસ્કૃતિનું મહત્ત્વનું અંગ મનાતા કુંભારો ગામમાં જેને ઘેર લગ્નનો પ્રસંગ આવે તેને ત્યાં જઇને ‘ગણેશ માટલી’ મૂકી આવે છે. ચૉરીના ચીતરેલાં વાસણો, ગોતરડો અને એના ઉપર મૂકવાનાં ચકલાંય મૂકી આવે છે. લગ્ન પ્રસંગે બાઈઓ વાજતેગાજતે કુંભારનો ચાક વધાવવા જાય છે. ચાકડો જેમ સર્જનનું પ્રતીક છે એમ લગ્ન કરનાર વરરાજાની સર્જનવેલ સતત ચાલતી રહે અને લીલીવાડી વધતી રહે એ માટેની પૂજા હોઇ શકે? અમુક કોમોમાં પુત્ર જન્મ પ્રસંગે કુંભારણ ટોપલો ભરીને માટીનાં રમકડાં, હાથી અને ઘોડા મૂકી આવે છે. એની પાછળની ભાવના એવી છે કે દીકરો મોટો થઇને રાજમાં હાથી-ઘોડા પર બેસે. આના બદલામાં કુંભારણ ‘અખિયાણું’ મેળવે છે. કુંભારની ગણતરી ગામડામાં વસવાયામાં થતી હોવાથી ખેડૂતોના ખેતરમાં ઘઊં વઢાય ત્યારે ‘મૂળિયું’ અને ખળાં લેવાય ત્યારે ‘ખળું’ માગવાનો એનો હક ગણાય છે.
  આમ કુંભારો મહેનતકશ પ્રજા છે. જીવનનિર્વાહ માટે રાત-દિવસ કાળી મજૂરી કરે છે. વહેલી સવારે ઊઠીને કુંભારણો માટીખાણ્યે જઇ ગધેડાં પર છાલકાં લાદી ગોરાડી માટી લઇ આવે છે. એને ચાળી, પલાળી ચીકવીને કુંભાર પોતાના ચાકડા પર જાતજાતનાં અને ભાતભાતનાં વાસણો બનાવે છે. ઉનાળામાં ચોમાસા માટેનાં નળિયાં અને દિવાળી ઢૂંકડી આવતાં કુલડી ને કોડિયાં બનાવે છે. કુંભારણ ટોપલામાં ભરીને ઘેરઘેર શુભ શુકનરૂપે મૂકી આવે છે. જૂના કાળે લોકજીવનમાં કેવા સરસ વ્યવહારો અને રિવાજો હતાં! </p>
  <p> ઈ.સ. ૩૦૦૦ વર્ષ પૂર્વે કુંભારીકામની કળા વિકાસની ચરમ સીમા પર પહોંચી હતી, પણ છેલ્લાં ૨ હજાર વર્ષથી તેની પડતી થવા પામી છે. કુંભારી કામની આ કળા કંઇક અંશે કચ્છના કુંભારોએ જાળવી રાખી છે. તેઓ વાસણ બનાવવાની, પકવવાની, રંગવાની, ચીતરવાની જૂની કલાપરંપરાને મહદ્અંશે વળગી રહ્યા છે. કચ્છના કુંભારો આજે ય હાથી, ઘોડા અને નાનાં બાળકો રમી શકે તેવાં જાતજાતનાં રમકડાં બનાવે છે. આંતરરાષ્ટ્રીય ખ્યાતિ ધરાવતા કચ્છના બુઢ્ઢા ચાચાનાં બનાવેલાં હસ્તીદીપ, ઉંટ અને ઘોડા આ લેખકના નિજી સંગ્રહમાં છે. બુઢ્ઢા ચાચા થોડા વરસ પહેલાં જન્નતનશીન થયા. સાત વર્ષની વયથી ચાકડા સાથે મહોબત બાંધીને બેઠેલા ભૂજના કુંભાર બુધાભાઇ પકવેલી માટીનાં આવા સરસ ‘રાધિકડાં’ બનાવે છે. માટીની કલાત્મક કારીગરી માટે એમને રાષ્ટ્રીય પારિતોષિક પણ પ્રાપ્ત થયું છે.
  કચ્છ- સૌરાષ્ટ્રના કુંભારો પાસે માટીકળાનો વારસો છે એવો જ પરંપરિત વારસો ઉત્તર અને દક્ષિણ ગુજરાતના આદિવાસી કુંભારો કને છે. તમે કોઇવાર ગુજરાતના આદિવાસી વિસ્તારોમાંથી પસાર થાઓ તો તમને કોઇ ગામના પાદરમાં કે સીમશેઢે મોટા ઝાડ નીચે ગોવાળદેવ, વાછડાદાદા, કરિયાબાવા, ઘોડાદેવ, ભાથુજી, ચમકલાબાવા, અને ભાદરવા દેવ જેવા ગ્રામદેવતાઓના સ્થાનકે માટીના ઘોડાના ઢગલા જોવા મળે છે. ચોધરી, ગામિત, ઢોડિયા, કોટવાળિયા, ભીલ વગેરે આદિજાતિના લોકો રોગદોગ મટાડવા, વાંઝીયામેણું ભાંગવા, ખેતીમાં બરકત માટે, ભૂતપ્રેત અને ચૂડેલના નિવારણ અર્થે દેવલાઓના સ્થાનકે કુંભારે બનાવેલા માટીના ઘોડા ચડાવે છે. એમાં પ્રાદેશિક કારીગરીનું વૈવિઘ્ય પણ જોવા મળે છે.</p>
  <p>દ. ગુજરાતમાં સૂરત, સોનગઢ અને માંડવીના કુંભારો માટીના ઘોડા ઉપરાંત ‘દેવલાઓ’ પણ બનાવે છે. શ્રી હકુ શાહ નોંધે છે કે કુંભાર લોકો આ બધા ‘દેવલાં’ બનાવે છે. માટી જોકે બહુ સારી ન હોવા છતાં એ લોકો માટીમાં ને માટીમાં ઘણું કામ કરે છે. તેઓ દેવળ, ગાય, કોઢ, મોટા માણસ સાથે ઘોડો, નાના માણસ સાથે ઘોડો, બળદ, ભેંસ, પુરુષ, સ્ત્રી, ગોવાળ, મા-બાળક, ડોબરાવાળો, વાઘ, હાથી, વાછરડાં, અરિસા સાથે સ્ત્રી આવું ઘણું બનાવે છે. આ બઘું કુંભાર સ્ત્રીઓ બનાવે છે. માટીના દેવળથી માંડીને ઘોડાના બધા જ ભાગ ડોક-મોઢું જુદું, પગ જુદાં એમ કરીને પછી જોડી દે. દેવળનો આકાર નાના મંદિર જેવો જ પણ નીચેથી ખુલ્લો અને આગળ એક બારણા જેવું રાખે છે. </p>
   <p>
  આજે તો કુંભારના દીકરાઓ ભણીગણીને નોકરી-ધંધે લાગતા જાય છે પણ કેટલાક ઉત્સાહી કુંભાર યુવાનો ફાઇન આર્ટસ અને એન.આઇ.ડી. સંસ્થામાં ભણીને માટીકામની કલાકારીને નવો ઓપ આપી તેને લોકપ્રિય બનાવાના પ્રયત્નો કરી રહ્યા છે, તેના પરિણામો પણ પ્રાપ્ત થવા લાગ્યાં છે. થાનગઢ બોટાદ, ધોળકા, વગેરે ગામના પ્રજાપતિઓએ ૫૦૦ જેટલી ડિઝાઇનોમાં કોઠીઓ, ફૂલદાની, કૂંડા, વોલપ્લેટ, વિવિધ આકાર- પ્રકારના કુંજા, માટીનાં વાસણો તુલસીક્યારો, વગાડો તો રીતસર રણકો કરે એવા ધૂઘરા વગેરે અનેક ચીજો તૈયાર કરે છે. જ્યારે અનેક પ્રદર્શનોમાં ભાગ લઇ ઈનામો જીતી આવેલા પાટણના શ્રી ભોગીલાલ ચિમનલાલ ઓતિયા અને અન્ય પંદર જેટલાં પ્રજાપતિ કુટુંબો નાગપંચમી અને જન્માષ્ટમી જેવા તહેવારો હોય ત્યારે નાગદેવતા, કાનુડો, મેળો આવતો હોય તો ગણેશ, રાધાકૃષ્ણ, રામ-સીતા જેવી મૂર્તિઓ બનાવીને વેચે છે, પણ ઓતિયા કુંભારની વિશેષ નામના વિજ્ઞાનનાં પ્રાયોગિક રમકડાં માટીમાંથી તૈયાર કરવા માટે છે, જેમાં પાણી પીને પેશાબ કરતો હાથી, વાસુદેવ પ્યાલો, કાચબા, દેડકાં અને માછલી જેવાં પાણીમાં તરતાં માટીનાં રમકડાં છે. શાળાના બાળકોમાં એણે અપાર આકર્ષણ ઊભું કર્યું છે.
  ‘ગામનો ગૉર અને પાદરનું તીરથ’ એનું મૂલ્ય આપણે મન ઝાઝું હોતું નથી, એમ માટીના વાસણો ને રમકડાં રોજ જોતાં હોઇએ એટલે એની નવાઇ ન લાગે, પણ કલાપ્રેમી વિદેશીઓ ગુજરાતમાં આવે છે ત્યારે આપણા ઘાટિલાં, રંગબેરંગી હાથકારીગરીવાળાં વાસણો અને રમકડાં જોઇને એના ભરપેટે વખાણ કરે છે અને નમૂના પોતાના દેશમાં સાચવીને પણ લઈ જાય છે. એક દાયકા પૂર્વે સાન ફ્રાન્સિસ્કોની સુપ્રસિઘ્ધ સંસ્થા ‘એસોસિએશન ઓફ ક્લે એન્ડ ગ્લાસ આર્ટીસ્ટ’ના બે સભ્યો શ્રી બાર્બરા અને શ્રી જેન કચ્છી કુંભારી કલાનો અભ્યાસ કરવા કચ્છમાં આવેલા, ત્યારે ત્યાંના અભણ કુંભાર કલાકારોના હાથનો માટીકલાનો કસબ જોઇને ખૂબ જ પ્રભાવિત થયાં હતાં. </p> <p>
  તેઓ અમેરિકા ગયા પછી ગુજરાતમાં ભયંકર ધરતીકંપ આવ્યો. ધરતીકંપ કરેલી કચ્છી પ્રજા અને કુંભારી કામના કારીગરોની તબાહીના સમાચારે આ અમેરિકન કલાકારોના હૈયાંમાં કચ્છી કુંભારો માટે કંઇક કરી છૂટવાની ઝંખના જગાડી. એને પરિણામે અમેરિકાની ‘નેશનલ ગેલેરી ઓફ મોર્ડન આર્ટ’માં પોટર્સ ઈન પેરિલ (પ્રજાપતિઓ જોખમમાં) નામે પ્રદર્શન યોજ્યું. એમાં સૌપ્રથમવાર ભારત અને અમેરિકાના પ્રજાપતિઓ- પોટર્સની કલાકૃતિઓ એકસાથે રજૂ થઇ. આના કારણે કચ્છી કુંભાર કલાકારોને આર્થિક ઉપાર્જન તો મળ્યું જ, પણ વિદેશમાં એમની માટીકલાના નમૂના ખૂબ જ પ્રશંસા પામ્યા. આપણે આ કુંભારોની પરંપરિત કલાને જીવાડવા આવું કશું ન કરી શકીએ? દેશી કારીગરોની ઉત્તમ કૃતિઓની આપણા ઘરઆંગણાને ન સજાવી શકીએ? આપણે ભારતીય સંસ્કૃતિની ધરોહરને જાળવવા માટે જાગૃત નહીં બનીએ તો આ પરંપરાને કોણ જીવાડશે? </p>
  આપણો પ્રજાપતિ
   આપણો પરીવાર
            
  </div>

  <div>
    <h2>આમદવાદ ઝોન કારોબારી સભ્ય </h2> 
    <Row>
        {this.state.memberList.filter((item) => item.zone_id == 1).map((item) => {
          return (
            <Col span={8}>{<h3>{item.s_name}</h3>} </Col>
            );
        })}
    </Row>
    {/* <Row>
    <Col span={8}>{<h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી)</h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>પ્રવીણભાઈ ડાહ્યભાઈ પ્રજાપતિ</h3>} </Col>
    <Col span={8}>{<h3>વિનોદભાઈ  દેસાઈભાઈ પ્રજાપતિ</h3>}</Col>
    <Col span={8}>{<h3>ઘનશ્યામભાઈ રમણભાઈ પ્રજાપતિ</h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>રમેશભાઈ  નરોત્તમભાઈ  પ્રજાપતિ</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ નરોત્તમભાઈ પ્રજાપતિ</h3>}</Col>
    <Col span={8}>{<h3> કેતનભાઈ ઘનશ્યામભાઈ પ્રજાપતિ </h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>જગદીશભાઈ  છોટાભાઈ પ્રજાપતિ</h3>} </Col>
    <Col span={8}>{<h3>જગદીશભાઈ છોટાભાઈ પ્રજાપતિ</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિ</h3>}</Col>
    </Row> */}
  </div>

  <div>
    <h2>વડોદરા ઝોન કારોબારી સભ્ય </h2>
    <Row>
        {this.state.memberList.filter((item) => item.zone_id == 2).map((item) => {
          return (
            <Col span={8}>{<h3>{item.s_name}</h3>} </Col>
            );
        })}
    </Row> 
    {/* <Row>
      <Col span={8}>{<h3>દેવેન્દ્રભાઈ અરવિંદભાઈ પ્રજાપતિ (પ્રમુખ)</h3>} </Col>
      <Col span={8}>{<h3>અશોકભાઈ સોમાભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
      <Col span={8}>{<h3>રણછોડભાઈ તળજાભાઈ મારૂ(સંગઠન મંત્રી</h3>}</Col>
      </Row>
      <Row>
      <Col span={8}>{<h3>અંબાલાલભાઈ છીતાભાઈ મારૂ હિરણી</h3>} </Col>
      <Col span={8}>{<h3>દુર્ગેશભાઈ ગોરધનભાઈ પ્રજાપતિ </h3>}</Col>
      <Col span={8}>{<h3>આશિષભાઈ રમેશભાઈ પ્રજાપતિ</h3>}</Col>
      </Row>
      <Row>
      <Col span={8}>{<h3>રતિલાલભાઈ છીતાભાઈ મારૂ</h3>} </Col>
      <Col span={8}>{<h3>ભરતભાઈ અંબાલાલ પ્રજાપતિ</h3>}</Col>
      <Col span={8}>{<h3>નટવરભાઈ છગનભાઈ મારૂ</h3>}</Col>
      </Row>
      <Row>
      <Col span={8}>{<h3>વિપુલભાઈ નટવરભાઈ મારૂ</h3>} </Col>
      <Col span={8}>{<h3>અશોકભાઈ ઠાકોરભાઈ પ્રજાપતિ</h3>}</Col>
      <Col span={8}>{<h3>નિલેશભાઈ કિશનભાઈ મારૂ </h3>}</Col>
      </Row>
      <Row>
      <Col span={8}>{<h3>પુંજાભાઈ છગનભાઈ પ્રજાપતિ</h3>} </Col>
      <Col span={8}>{<h3>કનુભાઈ રમણભાઈ પ્રજાપતિ</h3>}</Col>
      
      </Row> */}
  </div>

  <div>
    <h2>ભરૂચ ઝોન કારોબારી સભ્ય </h2>
    <Row>
        {this.state.memberList.filter((item) => item.zone_id == 3).map((item) => {
          return (
            <Col span={8}>{<h3>{item.s_name}</h3>} </Col>
            );
        })}
    </Row> 
  {/* <Row>
    <Col span={8}>{<h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી</h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી</h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી</h3>}</Col>
    </Row>
    <Row>
    <Col span={8}>{<h3>રવિભાઈ રમણભાઈ પ્રજાપતિ(પ્રમુખ)</h3>} </Col>
    <Col span={8}>{<h3>અરવિંદભાઈ દેસાઈભાઈ પ્રજાપતિ(ખજાનજી)</h3>}</Col>
    <Col span={8}>{<h3>પરેશભાઈ રમણભાઈ પ્રજાપતિતિ(સંગઠન મંત્રી</h3>}</Col>
    </Row> */}
  </div>

<div>
  <h2>કરજણ ઝોન કારોબારી સભ્ય </h2>
  <Row>
        {this.state.memberList.filter((item) => item.zone_id == 4).map((item) => {
          return (
            <Col span={8}>{<h3>{item.s_name}</h3>} </Col>
            );
        })}
  </Row> 
  {/* <Row>
  <Col span={8}>{1} </Col>
  <Col span={8}>{2}</Col>
  <Col span={8}>{3}</Col>
  </Row>
  <Row>
  <Col span={8}>{4}</Col>
  <Col span={8}>{5}</Col>
  <Col span={8}>{6}</Col>
  </Row>
  <Row>
  <Col span={8}>{7}</Col>
  <Col span={8}>{8}</Col>
  <Col span={8}>{9}</Col>
  </Row>
  <Row>
  <Col span={8}>{10}</Col>
  <Col span={8}>{11}</Col>
  <Col span={8}>{12}</Col>
  </Row> */}
</div>

<div>
  <h2>પાદરા ઝોન કારોબારી સભ્ય </h2>
  <Row>
        {this.state.memberList.filter((item) => item.zone_id == 5).map((item) => {
          return (
            <Col span={8}>{<h3>{item.s_name}</h3>} </Col>
            );
        })}
  </Row> 
  {/* <Row>
  <Col span={8}>{1} </Col>
  <Col span={8}>{2}</Col>
  <Col span={8}>{3}</Col>
  </Row>
  <Row>
  <Col span={8}>{4}</Col>
  <Col span={8}>{5}</Col>
  <Col span={8}>{6}</Col>
  </Row>
  <Row>
  <Col span={8}>{7}</Col>
  <Col span={8}>{8}</Col>
  <Col span={8}>{9}</Col>
  </Row>
  <Row>
  <Col span={8}>{10}</Col>
  <Col span={8}>{11}</Col>
  <Col span={8}>{12}</Col>
  </Row> */}
  </div>

  </div>
  </ContainerLayout>
  );
  }
}

export default Home;